TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
#include <msp430.h>
#include <stdio.h>
#include <string.h>
#include "sensor-library.h"

#define SDA_PIN BIT2
#define SCL_PIN BIT3
#define SDA BIT2
#define SCL BIT3

#define DEBUG false

extern void uart_write_string(const char *str);
extern void uart_write_int(int num);
extern void delay_ms(uint16_t ms);

// setting the reset & mfio pins
SparkFun_Bio_Sensor_Hub::SparkFun_Bio_Sensor_Hub(volatile uint8_t* resetPort, volatile uint8_t* resetOut, uint16_t resetBit,
                                                 volatile uint8_t* mfioPort, volatile uint8_t* mfioOut, volatile uint8_t* mfioRen, uint16_t mfioBit,
                                                 uint8_t address)
{

    // set the necessary pins
    _resetPort = resetPort;
    _resetOut = resetOut;
    //    _resetOut = resetPort + 2; // out is always +2 bits offset from port (disabled for now)
    _resetBit = resetBit;

    _mfioPort = mfioPort;
    _mfioOut = mfioOut;
    _mfioRen = mfioRen;
    //    _mfioOut = mfioPort + 2; // out is always +2 bits offset from port
    _mfioBit = mfioBit;

    _address = address;

    if (_resetPort != nullptr)
    {
        *_resetPort |= _resetBit; // set direction to output
        *_resetOut |= _resetBit;  // set pin high
    }

    if (_mfioPort != nullptr)
    {
        *_mfioPort |= _mfioBit; // set direction to output
        *_mfioOut |= _mfioBit;  // set pin high
    }
}

uint8_t SparkFun_Bio_Sensor_Hub::begin()
{
    if(DEBUG) uart_write_string("\tbegin part 1\n");

    // validate that pins ARE assigned
    if (_resetPort == nullptr || _mfioPort == nullptr)
    {
        return ERR_UNKNOWN; // MAX32664 general error code
    }

    if(DEBUG) uart_write_string("\tbegin part 2\n");

    // pull mfio high in reset for 10ms
    *_mfioOut |= _mfioBit;    // write mfio high
    *_resetOut &= ~_resetBit; // write reset low
    delay_ms(10);

    if(DEBUG) uart_write_string("\tbegin part 3\n");

    *_resetOut |= _resetBit; // write reset high
    delay_ms(1000);

    if(DEBUG) uart_write_string("\tbegin part 4\n");

    // set mfio to input
    *_mfioPort &= ~_mfioBit;
    *_mfioRen |= _mfioBit;
    *_mfioOut |= _mfioBit;

    if(DEBUG) uart_write_string("\tbegin part 5\n");

    // verify MAX32664 returned 0x00 (READ_DEVICE_MODE = 0x02)
    uint8_t responseByte = readByte(READ_DEVICE_MODE, 0x00);

    if(DEBUG) uart_write_string("\tbegin part 6\n");

    return responseByte;
}

// same as begin, but inverting some pins being held low/high
uint8_t SparkFun_Bio_Sensor_Hub::beginBootloader()
{

    // validate that pins ARE assigned
    if (_resetPort == nullptr || _mfioPort == nullptr)
    {
        return 0xFF; // MAX32664 general error code
    }

    // pull mfio high in reset for 10ms
    *_mfioOut &= ~_mfioBit;   // write mfio low
    *_resetOut &= ~_resetBit; // write reset low
    __delay_cycles(10000);    // 10ms delay @ 1MHz

    *_resetOut |= _resetBit; // write reset high
    __delay_cycles(50000);   // 50ms delay @ 1MHz for the bootloader

    // set mfio to output
    *_mfioOut |= _mfioBit;

    // verify MAX32664 returned 0x08 (READ_DEVICE_MODE = 0x02)
    uint8_t responseByte = readByte(READ_DEVICE_MODE, 0x00);
    return responseByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readSensorHubStatus()
{
    return readByte(HUB_STATUS, 0x00);
}

uint8_t SparkFun_Bio_Sensor_Hub::setOperatingMode(uint8_t selection)
{

    // parameter validation (must be 0x00, 0x02, or 0x08)
    if (selection != EXIT_BOOTLOADER && selection != SFE_BIO_RESET && selection != ENTER_BOOTLOADER)
    {
        return INCORR_PARAM; // 0xEE
    }

    // send mode change
    uint8_t statusByte = writeByte(SET_DEVICE_MODE, 0x00, selection);
    if (statusByte != SFE_BIO_SUCCESS)
    {
        return statusByte;
    }

    // wait for a verification
    __delay_cycles(100000); // 100ms delay @ 1MHz

    // READ_DEVICE_MODE = 0x02
    uint8_t responseByte = readByte(READ_DEVICE_MODE, 0x00);
    return responseByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::configBpm(uint8_t mode)
{

    if(DEBUG) uart_write_string("\tconfigBpm part 1\n");

    if (mode != MODE_ONE && mode != MODE_TWO)
    {
        if(DEBUG) uart_write_string("\tconfigBpm (INPUT CORRECT MODE)\n");
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\tconfigBpm part 2\n");

    uint8_t status;

    if(DEBUG) uart_write_string("\tconfigBpm part 3\n");

    status = setOutputMode(0x02);
    if (status != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\tconfigBpm (FAILED @ setOutputMode)\n");
        if(DEBUG) uart_write_int(status);
        return status;
    }

    if(DEBUG) uart_write_string("\tconfigBpm part 4\n");

    status = setFifoThreshold(0x01); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\tconfigBpm (FAILED @ setFifoThreshold)\n");
        return status;
    }

    if(DEBUG) uart_write_string("\tconfigBpm part 5\n");

    status = agcAlgoControl(ENABLE); // one sample before interrupt is fired
    if (status != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\tconfigBpm (FAILED @ acgAlgoControl)\n");
        return status;
    }

    if(DEBUG) uart_write_string("\tconfigBpm part 6\n");

    status = max30101Control(ENABLE);
    if (status != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\tconfigBpm (FAILED @ max30101Control)\n");
        return status;
    }

    if(DEBUG) uart_write_string("\tconfigBpm part 7\n");

    status = maximFastAlgoControl(mode);
    if (status != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\tconfigBpm (FAILED @ maximFastAlgoControl)\n");
        return status;
    }

    if(DEBUG) uart_write_string("\tconfigBpm part 8\n");

    _userSelectedMode = mode;
    _sampleRate = readAlgoSamples();

    if(DEBUG) uart_write_string("\tconfigBpm part 9\n");

    delay_ms(1000); // 1 second delay
    return SFE_BIO_SUCCESS;
}

uint8_t SparkFun_Bio_Sensor_Hub::configSensor()
{
    uint8_t status;

    status = setOutputMode(SENSOR_DATA);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = setFifoThreshold(0x01);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = max30101Control(ENABLE);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    status = maximFastAlgoControl(MODE_ONE);
    if (status != SFE_BIO_SUCCESS)
    {
        return status;
    }

    __delay_cycles(1000000); // 1 second delay @ 1MHz
    return SFE_BIO_SUCCESS;
}

uint8_t SparkFun_Bio_Sensor_Hub::configSensorBpm(uint8_t mode)
{

    if (mode != MODE_ONE && mode != MODE_TWO)
    {
        return 0xEE;
    }

    uint8_t status;

