TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
uint8_t SparkFun_Bio_Sensor_Hub::readDiastolicVals(uint8_t userArray[])
{
    const size_t numDiasVals = 3;
    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, DIASTOLIC_VALUE, numDiasVals, userArray);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeSystolicVals(uint8_t sysVal1, uint8_t sysVal2, uint8_t sysVal3)
{
    const size_t numSysVals = 3;
    uint8_t sysVals[3] = {sysVal1, sysVal2, sysVal3};

    return writeBytes(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, SYSTOLIC_VALUE, sysVals, numSysVals);
}

uint8_t SparkFun_Bio_Sensor_Hub::readSystolicVals(uint8_t userArray[])
{
    const size_t numSysVals = 3;

    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, SYSTOLIC_VALUE, numSysVals, userArray);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeBPTAlgoData(uint8_t bptCalibData[])
{
    const size_t numCalibVals = 824;
    return writeBytes(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, BPT_CALIB_DATA, bptCalibData, numCalibVals);
}

uint8_t SparkFun_Bio_Sensor_Hub::readBPTAlgoData(uint8_t userArray[])
{
    const size_t numCalibVals = 824;
    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, BPT_CALIB_DATA, numCalibVals, userArray);
}

uint8_t SparkFun_Bio_Sensor_Hub::isPatientResting(uint8_t resting)
{
    switch(resting)
    {
        case 0:
        case 1:
            break;
        default:
            return INCORR_PARAM;
    }

    return writeByte(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, PATIENT_RESTING, resting);
}

uint8_t SparkFun_Bio_Sensor_Hub::isPatientResting()
{
    return readByte(READ_ALGORITHM_CONFIG, BPT_CONFIG, PATIENT_RESTING);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeSP02AlgoCoef(int32_t intA, int32_t intB, int32_t intC)
{
    const size_t numCoefVals = 3;
    int32_t coefVals[numCoefVals] = {intA, intB, intC};

    return writeLongBytes(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, AGC_SP02_COEFS, coefVals, numCoefVals);
}

uint8_t SparkFun_Bio_Sensor_Hub::readSP02AlgoCoef(int32_t userArray[])
{
    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, AGC_SP02_COEFS, 3, userArray);
}

//// DRIVER FUNCTIONS ////

uint8_t SparkFun_Bio_Sensor_Hub::enableWrite(uint8_t _familyByte, uint8_t _indexByte, uint8_t _enableByte)
{
    uint8_t statusByte;

    //// START A WRITE ////
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0CTLW0 & UCTXSTT)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));
    
    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _enableByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    delay_ms(6);

    // delay based on config of familyByte & indexByte
    if(_familyByte == ENABLE_SENSOR && _indexByte == ENABLE_MAX30101) delay_ms(45);
    else if(_familyByte == ENABLE_ALGORITHM && _indexByte == ENABLE_AGC_ALGO) delay_ms(45);
    else if(_familyByte == ENABLE_ALGORITHM && _indexByte == ENABLE_WHRM_ALGO) delay_ms(45);

    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0CTLW0 |= UCTXSTP;

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    while(UCB0CTLW0 & UCTXSTP);

    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG)
        {
            uart_write_string("\twriteByte (1 byte) FAILED, status = ");
            uart_write_int(statusByte);
            uart_write_string("\n");
        }
        return ERR_UNKNOWN;
    }
    
    return statusByte;
}

// sending one write byte
uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte)
{
    uint8_t statusByte;

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 1\n");

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 2\n");

    // make sure we get a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 3\n");

    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 4\n");

    // set buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 5\n");

    // set buffer to write byte
    UCB0TXBUF = _writeByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 6\n");

    // send the stop signal
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 7\n");

    // wait for 6 ms
    delay_ms(6);

    //// READ STATUS BYTE ////

    // set uctr to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // wait for a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0CTLW0 |= UCTXSTP;

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 8\n");

    // wait for transmit to complete and for stop to be true
    while(!(UCB0IFG & UCRXIFG));

    // read the buffer
    statusByte = UCB0RXBUF;

    // wait for stop
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteByte (1 byte) part 9\n");

