TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    while (UCB0CTLW0 & UCTXSTT);                 // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP; // generate stop condition
    while (UCB0CTLW0 & UCTXSTP); // wait for stop to finish

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    // read status byte
    while (!(UCB0IFG & UCTXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return 0;
    }

    // read high byte
    while (!(UCB0IFG & UCRXIFG));
    returnVal = (uint16_t)UCB0RXBUF << 8;

    // read low byte
    UCB0CTLW0 |= UCTXSTP;
    while (!(UCB0IFG & UCRXIFG));
    returnVal |= UCB0RXBUF;

    while (UCB0CTLW0 & UCTXSTP);

    return returnVal;
}

uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, const size_t _len, uint8_t userArray[])
{
    uint8_t statusByte;

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    // set buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit to complete
    while(!(UCB0IFG & UCTXIFG));

    // set the buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit to complete
    while(!(UCB0IFG & UCTXIFG));

    // send the stop signal
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition is true
    while(UCB0CTLW0 & UCTXSTP);

    // wait for 6 ms
    delay_ms(6);

    //// START A READ ////

    // set UCTR to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    // wait for receive interrupt
    while(!(UCB0IFG & UCRXIFG));

    // set status byte to the interrupt
    statusByte = UCB0RXBUF;

    // check the status byte

    if(statusByte != SFE_BIO_SUCCESS)
    {
        // stop transmission
        UCB0CTLW0 |= UCTXSTP;

        // since we read the buffer, we automatically ACK'd for another buffer read
        // flush the buffer
        while(!(UCB0IFG & UCRXIFG));

        // create a dummy value to read the buffer
        uint8_t dummy = UCB0RXBUF;

        // wait for stop
        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }

    // loop for len indexes (i is set to size_t to match _len type)
    for(size_t i = 0; i != _len; i++)
    {
        // send the stop when we are at the last index (ex: length of 3's last index is 2)
        if(i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }

        // wait until we are good to read
        while(!(UCB0IFG & UCRXIFG));

        // set the array index to the buffer value
        userArray[i] = UCB0RXBUF;
    }

    // wait for stop to finish
    while(UCB0CTLW0 & UCTXSTP);

    // we already checked if status byte was good
    return statusByte;
}

// uses uint8_t user array
uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, uint8_t userArray[])
{
    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 1\n");

    uint8_t statusByte = 0xFF;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 2\n");

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 3\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 4 (transmitted family byte)\n");

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 5 (transmitted index byte)\n");

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 6 (transmitted write byte)\n");

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 7\n");

    while (!(UCB0IFG & UCTXIFG));    // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP;           // generate stop condition
    while (UCB0CTLW0 & UCTXSTP);    // wait for stop to finish

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 8\n");

    __delay_cycles(2000); // 2ms delay @ 1MHz

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 9\n");

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 10\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 11\n");

    // read status byte
    while (!(UCB0IFG & UCRXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    if(DEBUG)
    {
        uart_write_string("\treadMultipleBytes (uint8_t) part 12 statusByte = ");
        uart_write_int(statusByte);
        uart_write_string("\n");
    }

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\treadMultipleBytes (ERROR) statusByte != SFE_BIO_SUCCESS\n");
        UCB0CTLW0 |= UCTXSTP;
        while(!(UCB0IFG & UCRXIFG));
        uint8_t dummy = UCB0RXBUF;
        while(UCB0CTLW0 & UCTXSTP);
        return statusByte;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 13\n");
    
    for (size_t i = 0; i < _len; i++)
    {
        if (i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP; // stop before last byte
        }
        while (!(UCB0IFG & UCRXIFG));
        userArray[i] = UCB0RXBUF;
        if(DEBUG)
        {
            uart_write_string("\treadMultipleBytes (uint8_t) finished loop userArray[i] = ");
            uart_write_int(userArray[i]);
            uart_write_string("\n");
        }
    }
    
    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 14\n");

    while(UCB0CTLW0 & UCTXSTP);
    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, int32_t userArray[])
{
    uint8_t statusByte = 0xFF;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

