TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
        UCB0CTLW0 |= UCTXSTP;      // Always send STOP to release bus
        while (UCB0CTLW0 & UCTXSTP);
        UCB0IFG &= ~UCNACKIFG;     // Clear NACK flag for next loop
    }

    return 0;
}

void runI2CScannerBitBang()
{
    uart_write_string("Starting Bit-Bang I2C Scan...\r\n");

    // Ensure pins are GPIO and have internal pull-ups enabled
    P1SEL0 &= ~(SDA | SCL);
    P1SEL1 &= ~(SDA | SCL);
    P1REN |= (SDA | SCL);
    P1OUT |= (SDA | SCL);

    P1OUT |= BIT0; // Turn on LED

    for(uint8_t addr = 1; addr < 127; addr++)
    {
        // I2C Write Address = (addr << 1) + 0
        b_start();
        bool found = b_write(addr << 1);
        b_stop();

        if(found)
        {
            uart_write_string("Found bit-bang device at: ");
            uart_write_int(addr);
            uart_write_string("\r\n");
        }

        __delay_cycles(1000); // Small rest between pings
    }

    P1OUT &= ~BIT0; // Turn off LED
    uart_write_string("Scan Complete.\r\n");
}

int main(void)
{
    // stop watchdog & gpio high-impedance
    WDTCTL = WDTPW | WDTHOLD;
    PM5CTL0 &= ~LOCKLPM5;

    // init uart
    initUART();
    uart_clear_screen();    // clear the screen so we can properly see all the messages
    delay_ms(100);          // wait a little bit
    uart_write_string("\r\n--- SYSTEM STARTUP ---\n");

    // // ensure i2c lines are high
    P1SEL0 &= ~(BIT2 | BIT3);
    P1SEL1 &= ~(BIT2 | BIT3);
    P1DIR &= ~(BIT2 | BIT3); // inputs
    P1REN &= ~(BIT2 | BIT3); // external resistors

    // // toggle scl to clear
    P1DIR |= BIT3;
    for(int i = 0; i < 9; i++)
    {
        P1OUT &= ~BIT3;
        delay_ms(1);
        P1OUT |= BIT3;
        delay_ms(1);
    }

    uart_write_string("I2C Bus Recovered (ideally).\n");

    // // switch to hardware i2c mode
    P1SEL0 |= (BIT2 | BIT3);
    P1SEL1 &= ~(BIT2 | BIT3);   // double-checking
    UCB0CTLW0 = UCSWRST; // enable reset
    UCB0CTLW0 |= UCMST | UCMODE_3 | UCSYNC | UCSSEL__SMCLK | UCSWRST;
    UCB0BRW = 10;
    UCB0CTLW0 &= ~UCSWRST;

    uint8_t tester = runI2CScanner();

    // hardware scan
    if(tester == 0)
    {
        uart_write_string("CRITICAL: Hardware I2C could not find sensor.\n");
        runI2CScannerBitBang(); // last resort
        return 0;
    }
    else
    {
        uart_write_string("We exited the scanner!\n");
    }

    // init library

    uart_write_string("\n--- Initializing Bio Sensor ---\n");

    // need to disable PSELX to allow pins to be used as GPIO
    P2SEL0 &= ~(BIT0 | BIT1);
    P2SEL1 &= ~(BIT0 | BIT1);

    // create sensor instance
    SparkFun_Bio_Sensor_Hub bioHub(&P2DIR, &P2OUT, BIT0,
                                   &P2DIR, &P2OUT, &P2REN, BIT1,
                                   BIO_ADDRESS);
    // instance of bioData
    bioData body;

    uart_write_string("Created a sensor instance. Beginning sensor.\n");

    uint8_t result = bioHub.begin();

    // check if we got a response
    if(result == 0x00) {
        uart_write_string("SUCCESS: Bio Sensor Online!\r\n");

        // get mcu type
        uint8_t mcuType = bioHub.getMcuType();
        uart_write_string("MCU Type (0x01 expected): 0x");
        uart_write_int(mcuType);
        uart_write_string("\r\n");

        // get sensor hub version
        version hubVer = bioHub.readSensorHubVersion();
        uart_write_string("Hub Version: ");
        uart_write_int(hubVer.major);
        uart_write_string(".");
        uart_write_int(hubVer.minor);
        uart_write_string(".");
        uart_write_int(hubVer.revision);
        uart_write_string("\r\n");

        uint8_t error = bioHub.configBpm(MODE_ONE);

        if(error == SFE_BIO_SUCCESS) uart_write_string("Sensor Configured!\n");
        else uart_write_string("Error in configuring sensor.\n");

        while(1)
        {
            body = bioHub.readBpm();
            uart_write_string("Heartrate: ");
            uart_write_int(body.heartRate);
            uart_write_string("\n");
            uart_write_string("Confidence: ");
            uart_write_int(body.confidence);
            uart_write_string("\n");
            uart_write_string("Oxygen: ");
            uart_write_int(body.oxygen);
            uart_write_string("\n");
            uart_write_string("Status: ");
            uart_write_int(body.status);
            uart_write_string("\n");
            delay_ms(1000); // slow down the output
        }
    }
    else {
        uart_write_string("Error: Initialization failed. Code: ");
        uart_write_int(result);
        uart_write_string("\r\n");
    }

    while(1); // End of test
}
